lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaDimmableLightJoinable/ZigbeeHaDimmableLightJoinable.ino
#include <Arduino.h>
#include <string.h>

#include "nrf54l15_hal.h"
#include "zigbee_persistence.h"
#include "zigbee_security.h"
#include "zigbee_stack.h"

#if defined(NRF54L15_CLEAN_ZIGBEE_ENABLED) && (NRF54L15_CLEAN_ZIGBEE_ENABLED == 0)
#error "Enable Tools > Zigbee Support to build ZigbeeHaDimmableLightJoinable."
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_CHANNEL
#define NRF54L15_CLEAN_ZIGBEE_CHANNEL 15
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PAN_ID
#define NRF54L15_CLEAN_ZIGBEE_PAN_ID 0x1234
#endif

using namespace xiao_nrf54l15;

namespace {

static ZigbeeRadio g_radio;
static ZigbeeHomeAutomationDevice g_device;
static ZigbeePersistentStateStore g_store;
static Pwm g_pwm20(nrf54l15::PWM20_BASE);

static uint8_t g_macSequence = 1U;
static uint8_t g_nwkSequence = 1U;
static uint32_t g_nwkSecurityFrameCounter = 1U;
static uint32_t g_lastInboundSecurityFrameCounter = 0U;
static uint8_t g_apsCounter = 1U;
static uint8_t g_zclSequence = 1U;
static uint8_t g_zdoSequence = 1U;
static uint32_t g_lastJoinAttemptMs = 0U;
static uint32_t g_lastStatusMs = 0U;
static uint32_t g_lastPollMs = 0U;
static uint32_t g_lastReportMs[8] = {0U};
static bool g_joined = false;
static bool g_securityEnabled = false;
static bool g_savedOnOffState = false;
static uint8_t g_savedLevelState = 0x80U;
static bool g_pwmReady = false;

static ZigbeePersistentState g_restoredState{};
static bool g_haveRestoredState = false;

static constexpr uint8_t kPreferredChannel =
    static_cast<uint8_t>(NRF54L15_CLEAN_ZIGBEE_CHANNEL);
static constexpr uint16_t kPreferredPanId =
    static_cast<uint16_t>(NRF54L15_CLEAN_ZIGBEE_PAN_ID);
static constexpr uint16_t kCoordinatorShort = 0x0000U;
static constexpr uint16_t kLightShort = 0x7E02U;
static constexpr uint8_t kLocalEndpoint = 1U;
static constexpr uint8_t kCoordinatorEndpoint = 1U;
static constexpr uint64_t kCoordinatorIeee = 0x00124B000054A11FULL;
static constexpr uint64_t kIeeeAddress = 0x00124B0001AC1002ULL;
static constexpr uint8_t kStateFlagJoined = 0x01U;
static constexpr uint8_t kStateFlagSecurityEnabled = 0x02U;
static constexpr uint8_t kDemoNetworkKeySequence = 0x01U;
static const uint8_t kDemoNetworkKey[16] = {0xA1U, 0xB2U, 0xC3U, 0xD4U,
                                            0xE5U, 0xF6U, 0x07U, 0x18U,
                                            0x29U, 0x3AU, 0x4BU, 0x5CU,
                                            0x6DU, 0x7EU, 0x8FU, 0x90U};

static uint8_t g_channel = kPreferredChannel;
static uint16_t g_panId = kPreferredPanId;
static uint16_t g_localShort = kLightShort;
static uint16_t g_parentShort = kCoordinatorShort;
static uint64_t g_extendedPanId = 0U;

struct ScanResult {
  bool valid = false;
  uint8_t channel = 0U;
  int8_t rssiDbm = -127;
  ZigbeeMacBeaconView beacon{};
};

void applyDefaultReporting() {
  g_device.configureReporting(kZigbeeClusterOnOff, 0x0000U,
                              ZigbeeZclDataType::kBoolean, 0U, 30U, 0U);
  g_device.configureReporting(kZigbeeClusterLevelControl, 0x0000U,
                              ZigbeeZclDataType::kUint8, 0U, 30U, 16U);
}

void applyReportingState() {
  if (!g_haveRestoredState || g_restoredState.reportingCount == 0U) {
    applyDefaultReporting();
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.reportingCount && i < 8U; ++i) {
    if (!g_restoredState.reporting[i].used) {
      continue;
    }
    g_device.configureReporting(g_restoredState.reporting[i].clusterId,
                                g_restoredState.reporting[i].attributeId,
                                g_restoredState.reporting[i].dataType,
                                g_restoredState.reporting[i].minimumIntervalSeconds,
                                g_restoredState.reporting[i].maximumIntervalSeconds,
                                g_restoredState.reporting[i].reportableChange);
  }
}

void applyBindingState() {
  if (!g_haveRestoredState || g_restoredState.bindingCount == 0U) {
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.bindingCount && i < 8U; ++i) {
    if (!g_restoredState.bindings[i].used) {
      continue;
    }
    (void)g_device.addBinding(g_restoredState.bindings[i].sourceEndpoint,
                              g_restoredState.bindings[i].clusterId,
                              g_restoredState.bindings[i].destinationAddressMode,
                              g_restoredState.bindings[i].destinationGroup,
                              g_restoredState.bindings[i].destinationIeee,
                              g_restoredState.bindings[i].destinationEndpoint);
  }
}

void applyLedState() {
  uint16_t dutyPermille = 0U;
  if (g_device.onOff()) {
    const uint16_t level = g_device.level();
    dutyPermille =
        static_cast<uint16_t>((static_cast<uint32_t>(level) * 1000UL) / 0xFEUL);
    if (dutyPermille == 0U && level > 0U) {
      dutyPermille = 1U;
    }
  }

  if (g_pwmReady) {
    (void)g_pwm20.setDutyPermille(dutyPermille);
    return;
  }

  (void)Gpio::write(kPinUserLed, dutyPermille == 0U);
}

void configureDeviceForCurrentNetwork() {
  ZigbeeBasicClusterConfig basic{};
  basic.manufacturerName = "CleanCore";
  basic.modelIdentifier = "X54-JOIN-DIM";
  basic.swBuildId = "0.3.0";
  basic.powerSource = 0x01U;
  g_device.configureDimmableLight(kLocalEndpoint, kIeeeAddress, g_localShort,
                                  g_panId, basic, 0x0000U);
  applyReportingState();
  applyBindingState();
  (void)g_device.setLevel(g_savedLevelState);
  (void)g_device.setOnOff(g_savedOnOffState);
}

bool persistState() {
  ZigbeePersistentState state{};
  ZigbeePersistentStateStore::initialize(&state);
  state.channel = g_channel;
  state.logicalType = static_cast<uint8_t>(ZigbeeLogicalType::kEndDevice);
  state.panId = g_panId;
  state.nwkAddress = g_localShort;
  state.parentShort = g_parentShort;
  state.manufacturerCode = g_device.config().manufacturerCode;
  state.ieeeAddress = kIeeeAddress;
  state.extendedPanId = g_extendedPanId;
  state.nwkFrameCounter = g_nwkSecurityFrameCounter;
  state.apsFrameCounter = g_apsCounter;
  state.keySequence = kDemoNetworkKeySequence;
  memcpy(state.networkKey, kDemoNetworkKey, sizeof(state.networkKey));
  state.incomingNwkFrameCounter = g_lastInboundSecurityFrameCounter;
  state.flags = g_joined ? kStateFlagJoined : 0U;
  if (g_securityEnabled) {
    state.flags |= kStateFlagSecurityEnabled;
  }
  state.onOffState = g_device.onOff();
  state.levelState = g_device.level();

  const ZigbeeReportingConfiguration* reporting = g_device.reportingConfigurations();
  uint8_t copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!reporting[i].used) {
      continue;
    }
    state.reporting[copied++] = reporting[i];
  }
  state.reportingCount = copied;
  const ZigbeeBindingEntry* bindings = g_device.bindings();
  copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!bindings[i].used) {
      continue;
    }
    state.bindings[copied++] = bindings[i];
  }
  state.bindingCount = copied;
  return g_store.save(state);
}

void restoreState() {
  memset(&g_restoredState, 0, sizeof(g_restoredState));
  g_haveRestoredState = false;
  g_savedOnOffState = false;
  g_savedLevelState = 0x80U;
  g_joined = false;
  g_securityEnabled = false;
  g_lastInboundSecurityFrameCounter = 0U;
  g_channel = kPreferredChannel;
  g_panId = kPreferredPanId;
  g_localShort = kLightShort;
  g_parentShort = kCoordinatorShort;
  g_extendedPanId = 0U;
  g_nwkSecurityFrameCounter = 1U;

