lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaDimmableLightJoinable/ZigbeeHaDimmableLightJoinable.ino
  ZigbeePersistentState state{};
  if (g_store.load(&state) && state.ieeeAddress == kIeeeAddress) {
    g_restoredState = state;
    g_haveRestoredState = true;
    g_savedOnOffState = state.onOffState;
    g_savedLevelState = state.levelState;
    if (g_savedLevelState == 0U && state.onOffState) {
      g_savedLevelState = 0x80U;
    }
    g_channel = (state.channel >= 11U && state.channel <= 26U) ? state.channel
                                                                : kPreferredChannel;
    g_panId = (state.panId != 0U) ? state.panId : kPreferredPanId;
    g_parentShort = (state.parentShort != 0U) ? state.parentShort
                                               : kCoordinatorShort;
    g_extendedPanId = state.extendedPanId;
    g_nwkSequence = 1U;
    g_nwkSecurityFrameCounter =
        (state.nwkFrameCounter != 0U) ? state.nwkFrameCounter : 1U;
    g_lastInboundSecurityFrameCounter = state.incomingNwkFrameCounter;
    g_apsCounter = static_cast<uint8_t>(state.apsFrameCounter & 0xFFU);
    g_securityEnabled = (state.flags & kStateFlagSecurityEnabled) != 0U;
    if ((state.flags & kStateFlagJoined) != 0U && state.nwkAddress != 0U &&
        state.nwkAddress != 0xFFFFU) {
      g_localShort = state.nwkAddress;
      g_joined = true;
    }
  }

  configureDeviceForCurrentNetwork();
  applyLedState();
}

void clearJoinState(bool clearStore) {
  g_joined = false;
  g_securityEnabled = false;
  g_lastInboundSecurityFrameCounter = 0U;
  g_channel = kPreferredChannel;
  g_panId = kPreferredPanId;
  g_localShort = kLightShort;
  g_parentShort = kCoordinatorShort;
  g_extendedPanId = 0U;
  if (clearStore) {
    memset(&g_restoredState, 0, sizeof(g_restoredState));
    g_haveRestoredState = false;
    g_savedOnOffState = false;
    g_savedLevelState = 0x80U;
  }
  configureDeviceForCurrentNetwork();
  applyLedState();
  if (clearStore) {
    g_store.clear();
  } else {
    persistState();
  }
}

bool sendApsFrame(uint16_t destinationShort, uint8_t destinationEndpoint,
                  uint16_t clusterId, uint16_t profileId, uint8_t sourceEndpoint,
                  const uint8_t* payload, uint8_t payloadLength) {
  if (!g_joined) {
    return false;
  }

  ZigbeeApsDataFrame aps{};
  aps.frameType = ZigbeeApsFrameType::kData;
  aps.destinationEndpoint = destinationEndpoint;
  aps.clusterId = clusterId;
  aps.profileId = profileId;
  aps.sourceEndpoint = sourceEndpoint;
  aps.counter = g_apsCounter++;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataFrame(aps, payload, payloadLength, apsFrame,
                                      &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = g_securityEnabled;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (g_securityEnabled) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kIeeeAddress;
    security.keySequence = kDemoNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, kDemoNetworkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

  return g_radio.transmit(psdu, psduLength, false, 1200000UL);
}

bool sendDeviceAnnounce() {
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!g_device.buildDeviceAnnounce(g_zdoSequence++, payload, &payloadLength)) {
    return false;
  }
  return sendApsFrame(g_parentShort, 0U, kZigbeeZdoDeviceAnnounce,
                      kZigbeeProfileZdo, 0U, payload, payloadLength);
}

bool sendAttributeReport(uint16_t clusterId) {
  uint8_t zclFrame[127] = {0U};
  uint8_t zclLength = 0U;
  if (!g_device.buildAttributeReport(clusterId, g_zclSequence++, zclFrame,
                                     &zclLength) ||
      zclLength == 0U) {
    return false;
  }

  uint64_t destinationIeee = 0U;
  uint8_t destinationEndpoint = kCoordinatorEndpoint;
  if (g_device.resolveBindingDestination(kLocalEndpoint, clusterId,
                                         &destinationIeee,
                                         &destinationEndpoint) &&
      destinationEndpoint != 0U) {
    return sendApsFrame(g_parentShort, destinationEndpoint, clusterId,
                        kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                        zclLength);
  }
  return sendApsFrame(g_parentShort, kCoordinatorEndpoint, clusterId,
                      kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                      zclLength);
}

bool activeScan(ScanResult* outResult) {
  if (outResult == nullptr) {
    return false;
  }
  memset(outResult, 0, sizeof(*outResult));

  uint8_t request[127] = {0U};
  uint8_t requestLength = 0U;
  if (!ZigbeeCodec::buildBeaconRequest(g_macSequence++, request, &requestLength)) {
    return false;
  }

  bool found = false;
  for (uint8_t channel = 11U; channel <= 26U; ++channel) {
    if (!g_radio.setChannel(channel)) {
      continue;
    }
    (void)g_radio.transmit(request, requestLength, false, 1200000UL);

    const uint32_t deadline = millis() + 70U;
    while (static_cast<int32_t>(millis() - deadline) < 0) {
      ZigbeeFrame frame{};
      if (!g_radio.receive(&frame, 4000U, 300000UL)) {
        continue;
      }

